from qiskit import QuantumCircuit
from qiskit_aer import AerSimulator

# 量子ビット5個
# q0, q1, q2 : データ量子ビット
# q3, q4     : シンドローム測定用の補助量子ビット
#
# 古典ビット2個
# c0, c1     : シンドローム結果を保存
qc = QuantumCircuit(5, 2)

# --------------------------------------------------
# 1. 論理 |1> を3量子ビットに符号化
# |1> -> |111>
# --------------------------------------------------

qc.x(0)
qc.cx(0, 1)
qc.cx(0, 2)

# --------------------------------------------------
# 2. わざと q1 に X エラーを起こす
# |111> -> |101>
# --------------------------------------------------

qc.x(1)

# --------------------------------------------------
# 3. シンドローム測定
#
# q3で q0 と q1 が同じか違うか調べる
# q4で q1 と q2 が同じか違うか調べる
# --------------------------------------------------

qc.cx(0, 3)
qc.cx(1, 3)

qc.cx(1, 4)
qc.cx(2, 4)

# --------------------------------------------------
# 4. 補助量子ビットだけ測定
# --------------------------------------------------

qc.measure(3, 0)
qc.measure(4, 1)
6
print(qc)

# --------------------------------------------------
# 5. シミュレーション
# --------------------------------------------------

simulator = AerSimulator()

result = simulator.run(qc, shots=1000).result()

counts = result.get_counts()

print(counts)